[

    
        {
            "title": "Service Systems",
            "content": "Need to write a blog.\n",
            "link": "http://0.0.0.0:4000/blog/service-systems/",
            "date": "2015-01-01 11:39:59 +0000",
            "excerpt": null
        }
    

    
        ,{
            "title": "Fundamentals of Service Systems",
            "content": "\n\t\n\tCardoso et al.. Springer 2015.\n\n\nThis book is available at Springer.com\n",
            "link": "http://0.0.0.0:4000/books/fundamentals-of-service-systems/",
            "date": "2015-01-01 11:39:59 +0000",
            "excerpt": null
        }
    

    
        ,{
            "title": "Service Systems",
            "content": "Need to write a blog.\n",
            "link": "http://0.0.0.0:4000/blog/ITIL-maturity/",
            "date": "2015-01-01 11:39:59 +0000",
            "excerpt": null
        }
    

    
        ,{
            "title": "Service Systems: Concepts, Modeling, and Programming",
            "content": "\n\t\n\tCardoso, Lopes, and Geert. Springer 2014.\n\n\nThis SpringerBrief explores the internal workings of service systems. \n\nThe authors propose a lightweight semantic model for an effective representation to capture the essence of service systems. Key topics include modeling frameworks, service descriptions and linked data, creating service instances, tool support, and applications in enterprises. Previous books on service system modeling and various streams of scientific developments used an external perspective to describe how systems can be integrated. This brief introduces the concept of white-box service system modeling as an approach to model the internal aspects and elements of service systems. This approach provides descriptions that can be used for service management, optimization, and analytics. \n\nService Systems: Concepts, Modeling, and Programming is designed for researchers, teachers, and advanced-level students who want to learn about the new emerging field of service science and IS/IT practitioners who are looking for better ways to describe, model, and communicate services.\n\nThis book is available at Springer.com\n",
            "link": "http://0.0.0.0:4000/books/service-systems-concepts-modeling-and-programming/",
            "date": "2014-10-01 12:39:28 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "Gestao de Workflows: Modelos, Metodos e Sistemas",
            "content": "\n\t\n\tAalst and Hee (Translation: Cardoso). UC Press 2009.\n\n\nThis book offers a comprehensive introduction to workflow management, the management of business processes with information technology. By defining, analyzing, and redesigning an organization’s resources and operations, workflow management systems ensure that the right information reaches the right person or computer application at the right time. The book provides a basic overview of workflow terminology and organization, as well as detailed coverage of workflow modeling with Petri nets. Because Petri nets make definitions easier to understand for nonexperts, they facilitate communication between designers and users. The book includes a chapter of case studies, review exercises, and a glossary.\n\nThis book is available in Portuguese at uc.pt/imprensa\n",
            "link": "http://0.0.0.0:4000/books/gestao-de-workflows-modelos-metodos-e-sistemas/",
            "date": "2009-09-15 12:00:17 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "Handbook of Research on Business Process Modeling",
            "content": "\n\t\n\tCardoso and Aalst. IGI Global 2009.\n\n\nIn the last 10 years, there has been an explosion in the number of theories, technologies, standards, and tools providing business process support. At the same time, process support has taken an increasingly important role within information systems development (process-aware systems). \n\nThe conjunction of these factors has created a need among practitioners (e.g., researchers, system analysts, IT consultants, business analysts, and chief process officers) for a book providing a broad overview of this promising field from an academic and industrial perspective. \n\nTo achieve this goal, this handbook will bring together in one place contributions from leading experts, thereby guaranteeing a broad and diverse base of knowledge and expertise. The need for a comprehensive and authoritative book on Research on Business Process Modeling is latent among researchers from academia and industry and from workflow and BPM vendors. Stakeholders are often overloaded with a massive amount of BPM data available on the Web, but with no coherent 360? view of the field. When referring to general theory, techniques, and technologies, publications refer to an array of survey articles, with no reference standing out as an agreed-upon source of common ground.\n\nThis book is available at igi-global.com\n",
            "link": "http://0.0.0.0:4000/books/handbook-of-research-on-business-process-modeling/",
            "date": "2009-05-01 11:59:46 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "Semantic Web Engineering in the Knowledge Society",
            "content": "\n\t\n\tCardoso and Lytras. IGI Global 2008.\n\n\nThe main objective of the book is to lay the foundations for understanding the technologies behind the Semantic Web. \n\nOrganizations are striving for literature that guides them in the development of end-to-end applications and systems that use semantics. While the industry is willing to use semantics, the academia has not yet shown how to systematically employ Semantic Web technologies to deploy a new breed of systems. \n\nThe book aims to provide relevant theories, tools, and methodologies to develop semantic applications. It is written for students and professionals who want to improve their understanding of how semantics and ontologies can be used inside organizations. It also aims at studying the application of semantics to each of the steps in the semantic applications lifecycle and how semantics can help address critical issues in reuse, integration, and interoperability.\n\nThis book is available at amazon.com\n",
            "link": "http://0.0.0.0:4000/books/semantic-web-engineering-in-the-knowledge-society/",
            "date": "2008-10-10 11:59:29 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "The Semantic Web: Real World Applications from Industry",
            "content": "\n\t\n\tCardoso, Hepp, Lytras. Springer 2008.\n\n\nSemantic Web: Real-World Applications from Industry offers a glimpse into the opening door of semantic technologies by means of concentrated examples of semantic applications in real business environments. \n\nFor quite a while, there has been evidence from academic research and early industrial prototypes that semantic technology can help humans and machines substantially in accessing and using the unprecedented, and exponentially growing, amount of information that the World Wide Web provides. Now semantic technology is moving from academic and industrial research into real products and applications.  This book provides a series of case studies which demonstrate how real benefits can be derived from the adoption of semantic technology in popular business domains, such as telecommunication, B2B integration, healthcare, education, and others.\n\nSemantic Web: Real-World Applications from Industry summarizes state-of-the art expertise and practical experiences from outstanding technology showcases. This volume was written as a joint effort of leading experts in the field of semantic technology from various backgrounds and countries, including industry, academia, and government agencies. It combines a detailed description of the challenges and technical solutions with a discussion of the actual results and a wealth of lessons learned, which will be invaluable for future investments into semantic technology.\n\nSemantic Web: Real-World Applications from Industry was designed for industry professionals and researchers interested in the current state and future of semantic technology. This book is also suitable as a secondary advanced-level text or reference for students in computer science.\n\nForeword by Michael L. Brodie, Chief Scientist, Verizon Communications, Cambridge, USA\n\nThis book is available at Springer.com\n",
            "link": "http://0.0.0.0:4000/books/the-semantic-web-real-world-applications-from-industry/",
            "date": "2008-06-15 11:58:31 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "Programacao de Sistemas Distribuidos em Java",
            "content": "\n\t\n\tCardoso. FCA 2008.\n\n\nThe purpose of this book is to present the concepts and technologies needed to develop distributed systems in Java. It describes and illustrates how sockets, CORBA, RPC, Java RMI, and Web services can be used to design and implement distributed systems. This book is an indispensable compendium for BSc/MSc students and professionals involved with the implementation of distributed systems. The topics covered include:\n\n\n  Evolution of Computing Systems \n  Data Networks \n  Distributed Systems Architectures \n  DNS: the Domain Name System \n  Programming with Sockets \n  CORBA \n  Java Remote Method Invocation \n  Web Services\n\n\nThis book is available from fca.pt\n",
            "link": "http://0.0.0.0:4000/books/programacao-de-sistemas-distribuidos-em-java/",
            "date": "2008-03-15 11:11:38 +0000",
            "excerpt": null
        }
    

    
        ,{
            "title": "Semantic Web Services: Theory, Tools and Applications",
            "content": "\n\t\n\tCardoso. IGI Global 2007.\n\n\nThe Semantic Web proposes the mark-up of content on the Web using formal ontologies that structure underlying data for the purpose of comprehensive and transportable machine understanding. Semantic Web Services: Theory, Tools and Applications brings contributions from researchers, scientists from both industry and academia, and representatives from different communities to study, understand, and explore the theory, tools, and applications of the Semantic Web.\n\nSemantic Web Services: Theory, Tools and Applications binds computing involving the Semantic Web, ontologies, knowledge management, Web services, and Web processes into one fully comprehensive resource, serving as the platform for exchange of both practical technologies and far reaching research.\n\nThis book is available at igi-global.com\n",
            "link": "http://0.0.0.0:4000/books/semantic-web-services-theory-tools-and-applications/",
            "date": "2007-03-31 11:58:52 +0100",
            "excerpt": null
        }
    

    
        ,{
            "title": "Semantic Web Services, Processes and Applications ",
            "content": "\n\t\n\tCardoso and Sheth. Springer 2006.\n\n\nSemantics, Web services, and Web processes promise better re-use, universal interoperability and integration. Semantics has been recognized as the primary tool to address the challenges of a broad spectrum of heterogeneity and for improving automation through machine understandable descriptions.\n\nSemantic Web Services, Processes and Applications brings contributions from researchers who study, explore and understand the semantic enabling of all phases of semantic Web processes. This encompasses design, annotation, discovery, choreography and composition. Also this book presents fundamental capabilities and techniques associated with ontological modeling or services, annotation, matching and mapping, and reasoning. This is complemented by discussion of applications in e-Government and bioinformatics.\n\nSemantic Web Services, Processes and Applications is structured for research scientists and graduate-level students in computer science, as well as practitioners in industry.\n\nThis book is available at Springer.com\n",
            "link": "http://0.0.0.0:4000/books/semantic-web-services-processes-and-applications/",
            "date": "2006-08-15 11:59:09 +0100",
            "excerpt": null
        }
    



    

    

    
        ,{
            "title": "Home",
            "content": "I am associate professor at the University of Coimbra, and affiliated to the Information Systems Group. I am currently involved in developing new types of Enterprise Systems using RDFS, SPARQL, Linked Data, Cloud Computing paradigms, and Service Descriptions. My main research interests include: semantic web, service systems, service description languages, and business process management.News---------------+ Sebastian Gotz, Thomas Ilsche, Jorge Cardoso, Josef Spillner, Thomas Kissinger, Uwe Assmann, Wolfgang Lehner, Wolfgang Nagel and Alexander Schill, Energy-Efficient Databases using Sweet Spot Frequencies, Green Cloud Computing Workshop (GCC), London, UK, 2014.+ Sebastian Gotz, Thomas Ilsche, Jorge Cardoso, Josef Spillner, et. al., Frequencies Energy-Efficient Data Processing at Sweet Spot. In [On the Move to Meaningful Internet Systems (OTM 2014)](http://www.onthemove-conferences.org). Amantea, Italy, 2014.+ Cardoso,  J.; Lopes,  R. and Poels,  G. [Service Systems: Concepts, Modeling, and Programming](http://www.springer.com/computer/database+management+%26+information+retrieval/book/978-3-319-10812-4\"), Springer, Germany, ISBN: 978-3-319-10812-4, pp. 112, 2014.+ Pedrinaci, C.; Cardoso, J. and Leidig, T. [Linked USDL: A Vocabulary for Web-scale Service Trading](/publications/Papers/CP-2014-073-ESWC-Linked-USDL.pdf).  In 11th Extended Semantic Web Conference (ESWC), Crete, Greece, 2014.+ Cardoso, J.; Binz, T.; Breitenbucher, Uwe; Kopp, O. and Leymann, F. [Cloud Computing Automation: Integrating USDL and TOSCA](/publications/Papers/CP-2013-068-CAISE-USDL-and-TOSCA.pdf). In 25th Conference on Advanced Information Systems Engineering (CAiSE  2013), pages 1-16, Springer, LNCS, Vol. 7908, 2013+ Francesco Guerra (Chair) and Jorge Cardoso (Vice-Chair). [COST Action IC1302: semantic KEYword-based Search on sTructured data sOurcEs](http://www.keystone-cost.eu), 2013-2017.Research---------------####Service Descriptions Linked USDL (Unified Service Description Language) enables describing business, software, or real-world services using computer-readable and computer-understandable specifications to make them tradable on the web/Internet. It uses RDFS to provide a shared model. Check Github and linked-usdl.orgBellow is an earlier video explaining the goal of USDL (please note that since then, XML has been replaced by RDFS).####Service SystemsThe Linked Service System model for the Unified Service Description Language (LSS-USDL) explores the development of lightweight semantic models to capture the essence of service systems. Real service systems can be modeled with LSS-USDL, they can be accessed and queried programmatically, and they can be annotated with background knowledge. Check Github and this recent book Service Systems.####Service Networks Service networks are a class of networks of emerging interest since worldwide economies are becoming increasingly connected. Nonetheless, while the economies of many countries are becoming service-oriented, very few studies on service networks exist. We seek understanding when, why, where, and how service networks function best is fundamental for the future because their analysis can provide an ``x-ray'' of service-based economies.Resources---------------+ [ACM Calendar of Events](http://campus.acm.org/calendar/) + [IEEE Conference Calls for Submissions](http://www.ieee.org/conferences_events/index.html) + [Google Trends](http://www.google.com/trends) About me---------------Prof. Dr. Jorge Cardoso is Associate Professor and joined the Information System Group at the University of Coimbra in 2009. He has authored/co-authored more than 125 scientific publications and has been part of more than 120 program committees and organization bodies (journals and conferences). He his author/editor of 9 books. He holds a US patent titled \"System and method of measuring process compliance\". GoogleScholar shows more than 4800 citations for his research work with an h-index of 31. He is currently writing his next book titled \"Service networks: a service science discipline\" which results from the research work of his areas of interest: business process management, semantic Web, the Internet of Services, and service engineering.He has participated in European, German and National research projects financed by the European Commission (FP7), the Education, Audiovisual and Culture Executive Agency (EACEA), the German Ministry for Education and Research (BMBF), SAP Research (SAP) and Fundacao para a Ciencia e Technologia (FCT). Previously he worked for several major companies such as SAP Research (Germany) on the Internet of Services, the Boeing Company in Seattle (USA) on Enterprise Application Integration and CCG/Zentrum fur Graphische Datenverarbeitung on Computer Supported Cooperative Work. He gave lectures at the University of Madeira (Portugal) -- where he obtained tenure -- and the University of Georgia (USA). He is currently leading the Genssiz center for service systems research (10+ members). In the past, he has led 2 large research groups. One while at SAP Research in Germany (15+ members) and another one, the SEED Laboratory (10+ members), while at the University of Madeira.He is a founding member of the IFIP Working Group 12.7 on Social Semantics. He created and led until 2009 the development of the W3C Unified Service Description Language (USDL). He regularly collaborates with the Knoesis Research Center (USA), the University of Georgia (USA), the University of Bayreuth (DE), the University of Eindhoven (NL), the Open University (UK), The University of Stuttgart (DE), SAP Research (DE), among others. His teaching, training, and consulting activities both in academia and in industry cover topics related to Service Management, Enterprise Architecture, Middleware technologies, and Semantic Web. He is an ISACA Academic Advocate (ISACA is a Worldwide association of IS professionals dedicated to the audit, control, and security of information systems).He completed his graduate studies with a Ph.D. from the University of Georgia (US) in 2002 and his undergraduate studies at the University of Coimbra, Portugal with a MSc and BSc in Informatics Engineering in 1995 and 1998, respectively.His current research interests are in the areas of Service models, cloud computing, service networks, service relationships, semantic web, service dynamics, business process management.Humour ---------------A good researcher says, \"Lets find out\", others say \"Nobody knows\". When a good researcher makes a mistake, he says, I was wrong\", others say \"It wasn't my fault\". A good researcher works harder than others and has more time. Others are always \"too busy\" to do what is necessary.  Adapted from Web page n. 1.236.784.322.345 of the InternetContact ---------------Prof. Jorge CardosoDepartamento de Engenharia InformaticaUniversidade da Coimbra3030-290 CoimbraPortugalTel: + 351 239 790 051, jcardoso [*.A._.T$] dei | uc | pt ",
            "link": "http://0.0.0.0:4000/",
            "date": null,
            "excerpt": null
        }
    

    

    
        ,{
            "title": "Publications",
            "content": "Journal ArticlesCardoso, J.; Pedrinaci, C.; Leidig, T.; Rupino, P. and Leenheer, P. D Foundations of Open Semantic Service Setworks.  In International Journal of Service Science, Management, Engineering,  and Technology, Vol. 4 (2): 1-16, 2013.   Leenheer, P. D; Cardoso, J. and Pedrinaci, C. Business Service Semantics: Case Study for Flanders Research Information  Space.  In International Journal of Information System Modeling and Design (IJISMD), Vol. - (-): -, 2013.   Cardoso,  J. and Bussler,  C. Mapping between heterogeneous XML and OWL transaction representations  in B2B integration.  In Data Knowl. Eng., Vol. 70 (12): 1046-1069, 2011.    Jung, J-Y.; Chin, C-H. and Cardoso, J. An entropy-based uncertainty measure of process models.  In Information Processing Letters, Vol. 111 (3): 135-141, 2011.   Terziyan, V.; Katasonov, A.; Cardoso, J.; Hauswirth, M. and Majumdar, A. PRIME: Proactive Inter-Middleware for Global Enterprise Resource  Integration.  In Eastern-European Journal of Enterprise Technologies, Vol. 51 (3/12): 3-16, 2011.   Cardoso,  J. Business Process Control-Flow Complexity: Metric, Evaluation, and  Validation.  In International Journal of Web Services Research, Vol. 5 (2): 49-76, 2008.   Cardoso,  J.; Bussler,  C. and Guerra,  F. Search Using Metadata, Semantics and Ontologies (Preface).  In International Journal of Metadata, Semantics and Ontologies, Vol. 3 (1): 1-2, 2008.   Rodrigues,  T.; Rosa,  P. and Cardoso,  J. Moving from Syntactic to Semantic Organizations using JXML2OWL.  In Computers in Industry, Vol. 59 (8): 808-819, 2008.   Cardoso,  J. Complexity Analysis of BPEL Web Processes.  In Journal of Software Process: Improvement and Practice (InterScience,  Wiley), Vol. 12: 35-49, 2007.   Cardoso,  J. The Semantic Web Vision: Where Are We?.  In IEEE Intelligent Systems, Vol. 22 (5): 84-88, 2007.   Cardoso,  J. and Lange,  C. A Framework for Assessing Strategies and Technologies for Dynamic  Packaging Applications in E-Tourism.  In Information Technology and Tourism (Cognizant Communication Corporation), Vol. 9 (1): 27-44, 2007.   Cravo,  G. and Cardoso,  J. Termination of Workflows A snapshot-based approach.  In Mathematica Balkanica, Vol. 21 (3-4), 2007.   Caires,  B. and Cardoso,  J. Using Semantic Web Technologies to Build Adaptable Enterprise Information  Systems.  In Journal of Interoperability in Business Information Systems (IBIS), Vol. 1 (3): 41-58, 2006.   Cardoso, J. Approaches to Developing Semantic Web Services.  In International Journal of Computer Science (IJCS), Vol. 1 (1), 2006.   Cardoso,  J. Developing Dynamic Packaging Systems using Semantic Web Technologies.  In Transactions on Information Science and Applications, Vol. 3 (4): 729-736, 2006.   Cardoso,  J. Poseidon: A framework to assist Web process design based on business  cases.  In International Journal of Cooperative Information Systems (IJCIS), Vol. 15 (1): 23-55, 2006.   Cardoso,  J. and Lenic,  M. Web Process and Workflow Path mining using the multimethod approach.  In International Journal of Business Intelligence and Data Mining (IJBIDM), Vol. 1 (3): 304-328, 2006.   Cardoso,  J.; Bostrom,  R. P. and Sheth,  A. Workflow Management Systems and ERP Systems: Differences, Commonalities,  and Applications.  In Information Technology & Management, Vol. 5 (3/4): 319-338, 2004.   Cardoso,  J.; Miller,  J. A.; Sheth,  A.; Arnold,  J. and Kochut,  K. Quality of service for workflows and web service processes.  In Journal of Web Semantics, Vol. 1 (3): 281-308, 2004.   Anyanwu,  K.; Sheth,  A.; Cardoso,  J.; Miller,  J.  A. and Kochut,  K. Healthcare Enterprise Process Development and Integration.  In Journal of Research and Practice in Information Technology, Special  Issue in Health Knowledge Management, Vol. 35 (2): 83-98, 2003.   Cardoso,  J. and Sheth,  A. Semantic e-Workflow Composition.  In Journal of Intelligent Information Systems (JIIS), Vol. 21 (3): 191-225, 2003.   Kochut,  K.; Arnold,  J.; Sheth,  A.; Miller,  J.  A.; Kraemer,  E.; Arpinar,  B. and Cardoso,  J. IntelliGEN: A Distributed Workflow System for Discovering Protein-Protein  Interactions.  In Distributed and Parallel Databases, An International Journal, Special  issue on Bioinformatics, Vol. 13 (1): 43-72, 2003.   Cardoso,  J.; Sousa,  J. P. and Teixeira,  J. C. SketchPad on the PowerMac.  In Computer Graphik Topics, Vol. 7 (4): 25-26, 1995. Book ChaptersCardoso, J. and Pinto, A. M. The Web Ontology Language (OWL) and its Applications.  In Encyclopedia of Information Science and Technology, pages 754-766, Information Science Pub, 2014.   Bicer, V.; Borgert, S.; Winkler, M.; Scheithauer, G.; Voigt, K.; Cardoso, J. and Aitenbichler, E. Modeling Services using ISE Framework: Foundations and Extensions.  In Modern Software Engineering Concepts and Practices: Advanced Approaches, pages 126-150, Information Science Pub, ISBN: 1609602153, 2011.   Cardoso,  J.; Winkler,  M.; Voigt,  K. and Berthold,   H. IoS-Based Services, Platform Services, SLA and Models for the Internet  of Services.  In Software and Data Technologies, pages 3-17, Springer Berlin Heidelberg, Communications in Computer and Information Science, Vol. 50, ISBN: 978-3-642-20116-5, 2011.   Cardoso,  J.; Aalst,  W. v. d.; Bussler,  C.; Sheth,  A. and Sandkuhl,  K. Inter-Enterprise System and Application Integration: A Reality Check.  In Enterprise Information Systems, pages 3-15, LNBI, Springer, ISBN: 978-3-540-88709-6, 2009.   Cardoso,  J.; Voigt,  K. and Winkler,  M. Service Engineering for The Internet of Services.  In Enterprise Information Systems, pages 15-27, Springer, ISBN: 978-3-642-00669-2 (Print) 978-3-642-00670-8 (Online), 2009.   Garc&ecirc;s,  R.; Jesus,  T. de; Cardoso,  J. and Valente,   P. Open Source Workflow Management Systems: A Concise Survey.  In 2009 BPM & Workflow Handbook, pages 179-190, Future Strategies Inc., Lighthouse Point, FL, USA, 2009.   Cardoso,  J. Applying Data Mining Algorithms to Calculate the Quality of Service  of Workflow Processes.  In Intelligent Techniques and Tools for Novel System Architectures, pages 3-18, Springer Berlin / Heidelberg, Studies in Computational Intelligence, Vol. 109, ISBN: 978-3-540-77621-5, 2008.   Cardoso,  J. Semantics for E-Commerce Applications.  In Electronic Commerce: Concepts, Methodologies, Tools, and Applications, Information Science Reference, Pennsylvania, USA, ISBN: 978-1-59904-943-4, 2008.   Cardoso,  J. The Semantic Web: A mythical story or a solid reality.  In Metadata and Semantics, pages 253-257, Springer, Heidelberg, 2008.   Cardoso,  J. and Aalst,  W. v. d. Path Mining and Process Mining for Workflow Management Systems.  In Encyclopedia of Data Warehousing and Mining, Encyclopedia of Data  Warehousing and Mining, pages 1489-1496, Information Science Reference, Pennsylvania, USA, ISBN: 978-1-60566-010-3, 2008.   Cardoso,  J.; Lytras,  M. and Hepp,  M. The Future of The Semantic Web For Enterprises.  In The Semantic Web: Real-World Applications from Industry, pages 3-15, Springer, Heidelberg, Germany, ISBN: 0-387-48530-9, 978-0-387-48530-0, 2008.   Cardoso,  J.; Miller,  J. A. and Emani,  S. Tutorial Lectures: Web Services Discovery Utilizing Semantically  Annotated WSDL.  In 4th International Summer School 2008, Venice Italy, September 7-11,  2008, pages 240-268, Springer, Berlin/Heidelberg, 2008.   Cardoso,  J. Developing Course Management Systems Using Semantic Web Technologies.  In The Semantic Web: Real-World Applications from Industry, Springer, Heidelberg, Germany, ISBN: 0-387-48530-9, 978-0-387-48530-0, 2007.   Cardoso,  J. The Syntactic and the Semantic Web.  In Semantic Web Services: Theory, Tools and Applications, IGI Global, ISBN: 978-1-59904-045-5, 978-1-59904-047-9, 2007.   Escorcio,  L. and Cardoso,  J. Editing Tools for Ontology Construction.  In Semantic Web Services: Theory, Tools and Applications, IGI Global, ISBN: 978-1-59904-045-5, 978-1-59904-047-9, 2007.   Gouveia,  A. and Cardoso,  J. OWL: Web Ontology Language.  In Encyclopedia of Information Science and Technology, Information Science Reference, Pennsylvania, USA, 2007.   Patterson,  R.; Miller,  J. A.; Cardoso,  J. and Davis,   M. Bringing Semantic Security to Semantic Web Services.  In The Semantic Web: Real-World Applications from Industry, Springer, Heidelberg, Germany, ISBN: 0-387-48530-9, 978-0-387-48530-0, 2007.   Pennington,  C.; Cardoso,  J.; Miller,  J. A.; Patterson,   R. and Vasquez,  I. Introduction to Web Services.  In Semantic Web Services: Theory, Tools and Applications, IGI Global, ISBN: 978-1-59904-045-5, 978-1-59904-047-9, 2007.   Vanderfeesten,  I.; Cardoso,  J.; Mendling,  J.; Reijers,   H. and Aalst,  W. v. d. Quality Metrics for Business Process Models.  In Workflow Handbook 2007, pages 179-190, Future Strategies Inc., Lighthouse Point, FL, USA, ISBN: 0-9777527-1-2, 2007.   Cardoso,  J. Semantics for E-Commerce Applications.  In Encyclopedia of E-Commerce, E-Government, and Mobile Commerce, pages 979-984, Idea Group, ISBN: 9781591407997, 2006.   Cardoso,  J. Office Automation Systems.  In Encyclopedia of Medical Devices and Instrumentation (2 ed.), pages 149-160, Wiley Publishers, 2006.   Cardoso,  J. Developing an OWL Ontology for E-Tourism.  In Semantic Web Services, Processes and Applications, Springer, 2006.   Cardoso,  J. Programming the Semantic Web.  In Semantic Web Services, Processes and Applications, Springer, 2006.   Cardoso,  J. and Sheth,  A. The Semantic Web and its Applications.  In Semantic Web Services, Processes and Applications, Springer, ISBN: 0-38730239-5, 2006.   Cardoso,  J. Developing Dynamic Packaging Applications using Semantic Web based  Integration.  In Semantic Web Technologies and eBusiness: Virtual Organization and  Business Process Automation, Idea Group, Inc., ISBN: 1-59904-192-8, 1-59904-193-6, 2005.   Cardoso,  J. Path Mining in Web processes using Profiles.  In Encyclopedia of Data Warehousing and Mining, pages 896-901, Idea Group Inc., 2005.   Cardoso,  J. How to Measure the Control-flow Complexity of Web processes and Workflows.  In Workflow Handbook 2005, pages 199-212, Future Strategies Inc., Lighthouse Point, FL, USA, ISBN: 0-9703509-8-8, 2005.   Cardoso,  J. and Fernandes,  J. D. SEED: SEmantic E-tourism Dynamic packaging.  In Semantic Web Fact Book, pages 58-60, Joint Special Edition of AIS SIGSEMIS and OPEN RESEARCH SOCIETY, 2005.   Cardoso,  J.; Miller,  J. A.; Su,  J. and Pollock,  J. Academic and Industrial Research: Do their Approaches Differ in Adding  Semantics to Web Services.  In LNCS, pages 14-21, Springer-Verlag, Heidelberg, Germany, 2005.   Cardoso,  J. and Sheth,  A. Introduction to Semantic Web Services and Web Process Composition.  In Semantic Web Service and Web Processes Conference, pages 1-13, Springer-Verlag, Heidelberg, Germany, ISBN: 3-540-24328-3, 2005.   Cardoso,  J.; Sheth,  A. and Miller,  J. A. Workflow Quality of Service.  In Enterprise Inter- and Intra-Organizational Integration - Building  International Consensus, pages 303-312, Kluwer Academic Publishers, Boston, MA, USA, 2002.   In ProceedingsPedrinaci, C.; Cardoso, J. and Leidig, T. Linked USDL: A Vocabulary for Web-scale Service Trading.  In 11th Extended Semantic Web Conference (ESWC), Crete, Greece, 2014.   Nabais, J. C.; Cruz, A.; Pinto, A. M. and Cardoso, J. Interface Design for IT Service Management.  In 9th Iberian Conference on Information Systems and Technologies (CISTI), Barcelona, Spain, 2014.   Seiringer, W.; Hottum, P. and Cardoso, J. Increasing Accuracy of Service Costing using Customer Involvement.  In SIG SVC Delivering and Managing Services in Systems of Service Systems Workshop, Milano, Italy, 2013.   Cardoso, J. Open Service Networks: Research Directions.  In Proceedings of C3S2E'13, pages 2-3, 2013.   Cardoso, J. Modeling Service Relationships for Service Networks.  In 4th International Conference on Exploring Service Science (IESS 1.3), pages 114-128, Springer, Porto, Portugal, LNBIP, Vol. 143, 2013.   Cardoso,  J.; A. Miller,  J.; Bowman,  C.; Haas,  C.; P. Sheth,  A. and W. Miller,  T. Open Service Network Analysis.  In 1st International IFIP Working Conference on Value-Driven Social  Semantics & Collective Intelligence (VaSCo), 2013.   Cardoso, J.; Binz, T.; Breitenb\"ucher, Uw; Kopp, O. and Leymann, F. Cloud Computing Automation: Integrating USDL and TOSCA.  In 25th Conference on Advanced Information Systems Engineering (CAiSE  2013), pages 1-16, Springer, LNCS, Vol. 7908, 2013.   Cardoso, J.; Jablonski, S. and Volz, B. A navigation metaphor to support mobile workflow systems.  In Second International Workshop on Theory and Applications of Process  Visualization (TAProViz'13), pages ??-??, 2013. Cardoso, J.; Pedrinaci, C. and Leenheer, P. D Open Semantic Service Networks: Modeling and Analysis.  In 4th International Conference on Exploring Service Science (IESS 1.3), pages 141-154, Springer, Porto, Portugal, LNBIP, Vol. 143, 2013.   Leenheer, P. D; Cardoso, J. and Pedrinaci, C. Ontological Representation and Governance of Business Semantics in  Compliant Service Networks.  In 4th International Conference on Exploring Service Science (IESS 1.3), pages 155-169, Springer, Porto, Portugal, LNBIP, Vol. 143, ISBN: 978-3-642-36355-9, 2013.   Seiringer, W.; Cardoso, J. and Bischhoffshausen, J. K. vo Service System Analytics: Cost Prediction.  In 14th IFIP Working Conference on Virtual Enterprises (PRO-VE'13),  Dresden, Germany, 30 Sep-2 Oct 2013., Springer, 2013. Seiringer,  W.; Hottum,  P. and Cardoso,  J. Increase Accuracy of Service Costing using Customer Involvement  - An Application Scenario based on Service System Analytics.  In Proceedings of the SIG Service Workshop, Milan, Italy, 2013. Cardoso, J. and Miller, J. A Internet-Based Self-Services: from Analysis and Design to Deployment.  In The 2012 IEEE International Conference on Services Economics (SE  2012), IEEE Computer Society, Hawaii, USA, 2012.   Cardoso, J.; Pedrinaci, C.; Leidig, T.; Rupino, P. and Leenheer, P. D Open semantic service networks.  In The International Symposium on Services Science (ISSS 2012), pages 1-15, Leipzig, Germany, 2012.   Cardoso, J. and Rupino, P. Service Science: concepts, tools and platforms to support digital  services for SME.  In Workshop on Enterprise Systems and Technology (I-WEST 2011), 2011.   S&aacute;nchez-Gonz&aacute;lez, L.; Ruiz, F.; Garc&iacute;a, F. and Cardoso, J. Towards Thresholds of Control Flow Complexity Measures for BPMN models.  In 26th Symposium On Applied Computing (SAC 2011), pages 1445-1450, Taichung, Taiwan, 2011.   Cardoso,  J.; Barros,  A.; May,  N. and Kylau,  U. Towards a Unified Service Description Language for the Internet of  Services: Requirements and First Developments.  In IEEE International Conference on Services Computing, IEEE Computer Society Press, Florida, USA, 2010.   Cardoso,  J. The Internet of Services.  In Proceedings of the 4th International Conference on Software and Data  Technologies (ICSOFT 2009), pages IS7-IS10, Sofia, Bulgaria, ISBN: 978-989-674-009-2, 2009.   Cardoso,  J.; Winkler,  M. and Voigt,  K. A Service Description Language for the Internet of Services.  In First International Symposium on Services Science (ISSS'09), Leipzig, Germany, ISBN: 978-3-8325-2169-1, 2009.   Dividino,  R. Q.; Bicer,  V.; Voigt,  K. and Cardoso,   J. Integrating business process and user interface models using a model-driven  approach.  In The 24th International Symposium on Computer and Information Sciences  (ISCIS 2009), pages 492-497, IEEE, North Cyprus, 2009.   Gerke,  K.; Cardoso,  J. and Claus,  A. Measuring the Compliance of Processes with Reference Models.  In 17th International Conference on Cooperative Information Systems  (CoopIS 2009), Springer, Algarve, Portugal, 2009.   Rol&oacute;n,  E.; Cardoso,  J.; Garc'ia,  F.; Ruiz,  F. and Piattini,  M. Analysis and Validation of Control-Flow Complexity Measures with  BPMN Process Models.  In International Workshops on Business Process Modeling, Development  and Support (BPMDS), Springer, Amsterdam, The Netherlands, 2009.   Spillner,  J.; Winkler,  M.; Reichert,  S.; Cardoso,   J. and Schill,  A. Distributed Contracting and Monitoring in the Internet of Services.  In 9th IFIP international conference on Distributed Applications and  Interoperable Systems, pages 129-142, Springer, Lisbon, Portugal, 2009.   Cardoso,  J. Service Engineering for Future Business Value Networks.  In Tenth International Conference on Enterprise Information Systems  (ICEIS 2008), pages 15-20, Barcelona, Spain, ISBN: 978-989-8111-37-1, 2008.   Kett,  H.; Voigt,  K.; Scheithauer,  G. and Cardoso,   J. Service Engineering in Business Ecosystems.  In Proceedings of the XVIII International RESER Conference, pages 1-22, Fraunhofer IRB, Stuttgart, Germany, 2008.   Vanderfeesten,  I.; Mendling,  J.; Reijers,  H.; Aalst,   W. v. d. and Cardoso,  J. On a Quest for Good Process Models: The Cross-Connectivity Metric.  In 20th International Conference on Advanced Information Systems Engineering  (CAiSE 2008), pages 480-494, Springer, Montpellier, France, LNCS, Vol. 5074, ISBN: 978-3-540-69533-2, 2008.   Winkler,  M.; Cardoso,  J. and Scheithauer,  G. Challenges of Business Service Monitoring.  In Tenth International Conference on Information Integration and Web  Based Applications & Services (iiWAS), ACM and Austrian Computer Society, Linz, Austria, 2008.   Caires,  B. and Cardoso,  J. Using Semantic Web and Service Oriented Technologies to Build Loosely  Coupled Systems.  In 9th International Conference on Enterprise Information Systems (ICEIS  2007), pages 226-232, Funchal, Madeira, Portugal, 2007.   Cardoso,  J. Business Process Quality Metrics: Log-based Complexity of Workflow  Patterns.  In International Conference on Cooperative Information Systems (CoopIS'07), Springer, Algarve, Portugal, 2007.   Cardoso,  J. Integrating HAD Organizational Data Assets using Semantic Web Technologies.  In 3rd International Conference Interoperability for Enterprise Software  and Applications (I-ESA 2007), pages 333-344, Springer, Funchal, Portugal, ISBN: 978-1-84628-857-9, 2007.   Cravo,  G. and Cardoso,  J. Snapshot-Based Theory: An Interdisciplinary Approach.  In 1st Joint International Meeting between the American Mathematical  Society and the New Zealand Mathematical Society, American Mathematical Society, Wellington, New Zealand, 2007. Gouveia,  M. and Cardoso,  J. Tourism Information Aggregation Using an Ontology based approach.  In 9th International Conference on Enterprise Information Systems (ICEIS  2007), pages 569-572, Funchal, Madeira, Portugal, 2007.   Hrastnik,  J. and Cardoso,  J. Integrating Heterogeneous Business Process Knowledge for Better Process  Models.  In The Fifth International Conference on Quality and Reliability, John Wiley & Sons, Chiang Mai, Thailand, 2007. Hrastnik,  J. and Cardoso,  J. Business Process Knowledge Integration: A Semantic Based Approach.  In I-SEMANTICS '07 - 3rd International Conference on Semantic Technologies,  within the TRIPLE-I conference, Springer, Graz, Austria, 2007.   Hrastnik,  J.; Cardoso,  J. and Kappe,  F. The Business Process Knowledge Framework.  In 9th International Conference on Enterprise Information Systems (ICEIS  2007), pages 517-520, Funchal, Madeira, Portugal, 2007.   Mendling,  J.; Reijers,  H. and Cardoso,  J. What Makes Process Models Understandable?.  In The 5th International Conference on Business Process Management (BPM  2007), pages 48-63, Brisbane, Australia, 2007.   Vanderfeesten,  I.; Cardoso,  J. and Reijers,  H. A weighted coupling metric for business process models.  In The 19th International Conference on Advanced Information Systems  Engineering (CAiSE 2007), CAiSE Forum, Trondheim, Norway, 2007.   Cardoso,  J. Combining the Semantic Web with Dynamic Packaging Systems.  In International Conference on Artificial Intelligence, Knowledge Engineering  and Databases (AIKED '06), pages 133-138, Madrid, Spain, ISBN: 960-8457-41-6, 2006.   Cardoso,  J. Process control-flow complexity metric: An empirical validation.  In IEEE International Conference on Services Computing (IEEE SCC 06), pages 167-173, IEEE Computer Society, Chicago, USA, ISBN: 0-7695-2670-5, 2006.   Cardoso,  J. Approaches to Compute Workflow Complexity.  In Dagstuhl Seminar Proceedings: The Role of Business Processes in Service  Oriented Architectures, Internationales Begegnungs- und Forschungszentrum  fuer Informatik (IBFI), Schloss Dagstuhl, Germany, 2006.   Cardoso,  J. Discovering Semantic Web services with and without a Common Ontology  Commitment.  In The 3rd International Workshop on Semantic and Dynamic Web Processes  (SDWP 2006), In conjunction with the 2005 IEEE International Conference  Web Services (ICWS 2006), pages 183-190, IEEE Computer, Chicago, USA, ISBN: 0-7695-2681-0, 2006.   Cardoso,  J. Benchmarking a Semantic Web Service Architecture for Fault-tolerant  B2B Integration.  In International Workshop on Dynamic Distributed Systems (IWDDS), In  conjunction with the 26th International Conference on Distributed  Computing Systems (ICDCS), IEEE Computer Society, Lisboa, Portugal, ISBN: 0-7695-2541-5, 2006.   Cardoso,  J. Workflow Quality of Service Management using Data Mining Techniques.  In 3rd IEEE International Conference on Intelligent Systems (IEEE IS'  06), pages 479-782, IEEE Computer Society, University of Westminster, London, UK, ISBN: 1-4244-0196-8, 2006.   Cardoso,  J. Poseidon: Uma aplicacao de suporte ao desenho semi-automatico de  workflows.  In XATA2006 XML: Aplicacoes e Tecnologias Associadas, pages 337-349, Portalegre, Portugal, ISBN: 972-99166-2-4, 2006.   Cardoso,  J. Semantic integration of Web services and peer-to-peer networks to  achieve fault-tolerance.  In Special Session on Semantic Web Services: Theory and Applications,  2006 IEEE International Conference on Granular Computing, pages 796-799, IEEE Society, Atlanta, GA, USA, ISBN: 1-4244-0133-X, 2006.   Cardoso,  J. and Cravo,  G. Verifying the logical termination of workflows.  In 5th Annual Hawaii International Conference on Statistics, Mathematics  and Related Fields, pages 330-346, Honolulu, Hawaii, USA, 2006.   Cardoso,  J.; Mendling,  J.; Neumann,  G. and Reijers,   H. A Discourse on Complexity of Process Models.  In BPI06 - Second International Workshop on Business Process Intelligence,  In conjunction with BPM 2006, pages 115-126, Springer-Verlag, Berlin, Heidelberg, Vienna, Austria, 2006.   Cravo,  G. and Cardoso,  J. Termination of Workflows.  In MASSEE International Congress on Mathematics, pages 33-34, MASSEE Mathematical Society of South Eastern Europe, Paphos, Cyprus, ISBN: 9963-9277-0-X, 2006.   Cravo,  G. and Cardoso,  J. Verifying the Termination of Workflows.  In International Conference of Numerical Analysis and Applied Mathematics  (ICNAAM), pages 85-88, Wiley-VCH Verlag, Crete, Greece, ISBN: 3-527-40743-X, 2006.   Rodrigues,  T.; Rosa,  P. and Cardoso,  J. Mapping XML to existing OWL ontologies.  In International Conference WWW/Internet 2006, pages 72-77, Spain, ISBN: 972-8924-19-4, 2006.   Schmeing,  T.; Cardoso,  J. and Fernandes,  J. D. Knowledge-based Dynamic Packaging Model.  In 3rd IEEE International Conference on Management of Innovation and  Technology (ICMIT 2006), pages 1085-1089, IEEE Computer Society, Singapore, ISBN: 1-4244-0148-8, 2006.   Schmeing,  T.; Cardoso,  J. and Fernandes,  J. D. eTourism: The Knowledge-based Packaging Model.  In Workshop on Dynamic and Intelligent Configuration of Tourism Services, University of Twente, The Netherlands, 2006.   Silva,  B. and Cardoso,  J. Semantic Data Extraction for B2B Integration.  In International Workshop on Distributed Applications for B2B Integration  (DABI 2006), In conjunction with the 26th International Conference  on Distributed Computing Systems (ICDCS 2006), IEEE Computer Society, Lisboa, Portugal, ISBN: 0-7695-2541-5, 2006.   Cardoso,  J. Control-flow Complexity Measurement of Processes and Weyuker's Properties.  In 6th International Conference on Enformatika, pages 213-218, International Academy of Sciences, Budapest, Hungary, ISBN: 975-98458-7-3, 2005.   Cardoso,  J. About the Complexity of Teamwork and Collaboration Processes.  In IEEE International Symposium on Applications and the Internet (SAINT  2005), Workshop - Teamware: supporting scalable virtual teams in  multi-organizational settings, pages 218-221, IEEE Computer Society, Trento, Italy, ISBN: 0-7695-2262-9, 2005.   Cardoso,  J. About the Data-Flow Complexity of Web Processes.  In 6th International Workshop on Business Process Modeling, Development,  and Support: Business Processes and Support Systems: Design for Flexibility, pages 67-74, Porto, Portugal, ISBN: 972-752-077-4, 2005.   Cardoso,  J. E-Tourism: Creating Dynamic Packages using Semantic Web Processes.  In W3C Workshop on Frameworks for Semantics in Web Services, Innsbruck, Austria, 2005.   Cardoso,  J. Evaluating the Process Control-flow Complexity Measure.  In IEEE International Conference on Web Services (ICWS 2005), pages 803-804, IEEE Computer Society, Orlando, Florida, USA, ISBN: 0-7695-2409-5, 2005.   Cardoso,  J. On the Move to Semantic Web Services.  In 6th International Enformatika Conference, pages 13-24, International Academy of Sciences, Budapest, Hungary, ISBN: 975-98458-7-3, 2005.   Cardoso,  J. and Sheth,  A. Adaptation and Workflow Management Systems.  In International Conference WWW/Internet 2005, pages 356-364, Lisbon, Portugal, ISBN: 972-8924-02-X, 2005.   Correia,  M and Cardoso,  J. Aumento da resiliencia dos Web services com uma Infra-estrutura Peer-to-Peer.  In 6a Conferencia da Associacao Portuguesa de Sistemas de Informacao  (CAPSI 2005), Braganca, Portugal, ISBN: 972-95246-3-7, 2005.   Cardoso,  J. Adaptive Algorithm to Predict the QoS of Web Processes and Workflows.  In International Conference on Computational Intelligence (ICCI 2004), pages 490-493, Istanbul, Turkey, ISBN: 975-98458-1-4, 2004.   Cardoso,  J. Issues of Dynamic Travel Packaging using Web Process Technology.  In International Conference e-Commerce 2004, pages 357-362, Lisbon, Portugal, ISBN: 972-98947-8-7, 2004.   Cardoso,  J. Extending Workflow Systems with QoS Management.  In International Conference on Computational & Experimental Engineering  and Sciences, pages 599-604, Madeira, Portugal, 2004.   Cardoso,  J. Building workflows definitions based on business cases.  In First International Workshop on Computer Supported Activity Coordination  (CSAC-2004), ICEIS 2004, 6th International Conference on Enterprise  Information Systems, pages 3-12, Porto, Portugal, 2004.   Cardoso,  J. and Sheth,  A. Semantic Web Processes: Semantics Enabled Annotation, Discovery,  Composition and Orchestration of Web Scale Processes.  In Fourth International Conference on Web Information Systems Engineering  (WISE'03), pages 375, IEEE Computer Society, Roma, Italy, 2003.   Cardoso,  J. Composing e-Workflows using Syntactic, Operational and Semantic Information.  In International Conference WWW/Internet, pages 528-531, Cacilgrafica, Lisbon, Portugal, ISBN: 972-9027-53-6, 2002.   Cardoso,  J. and Sheth,  A. Process Quality of Service Specification.  In EI3-IC workshop at NIST, Gaithersburg, MD, USA, 2002.   Chandrasekaran,  S.; Silver,  G.; Miller,  J. A.; Cardoso,   J. and Sheth,  A. Web service technologies and their synergy with simulation.  In Proceedings of the 2002 Winter Simulation Conference (WSC'02), pages 606-615, San Diego, CA, USA, 2002.   Miller,  J. A.; Cardoso,  J. and Silver,  G. Using Simulation to Facilitate Effective Workflow Adaptation.  In Proceedings of the 35th Annual Simulation Symposium (ANSS'02), pages 177-181, IEEE Computer Society, San Diego, CA, USA, 2002.   Sheth,  A.; Cardoso,  J.; Miller,  J. A.; kochut,  K. and Kang,  M. Service-oriented Middleware.  In The 6th World Multiconference on Systemics, Cybernetics and Informatics  (SCI 2002), pages 528-534, Orlando, FL, 2002. Sheth,  A.; Cardoso,  J.; Miller,  J. A.; Kochut,  K. and Kang,  M. QoS for Service-Oriented Middleware.  In 6th World Multiconference on Systemics, Cybernetics and Informatics  (SCI'02), pages 528-534, Orlando, Florida, USA, 2002.   Cardoso,  J.; Luo,  Z.; Miller,  J. A.; Sheth,  A. and Kochut,  K. Survivability Architecture for Workflow Management Systems.  In Proceedings of the 39th Annual ACM Southeast Conference, pages 207-216, ACM Press, Athens, GA, USA, 2001.   Cardoso,  J. and Teixeira,  J. C. Empresa virtual: uma realidade.  In Encontro Nacional de Engenharia e Gest&atilde;o Industrial (ENEGI), Lisbon, Portugal, 1998.   Cardoso,  J. and Teixeira,  J. C. Workflow Management Systems: A Prototype for the University of Coimbra.  In 5th International Conference on Concurrent Engineering, pages 83-87, Tokyo, Japan, 1998.   BooksCardoso,  J.; Lopes,  R. and Poels,  G. Service Systems: Concepts, Modeling, and Programming.  Springer, Germany, ISBN: 978-3-319-10812-4, pp. 112, 2014. &nbsp; Aalst,  W. v. d. and Hee,  K. v. Gest&atilde;o de Workflows. Modelos, m&eacute;todos e sistemas (Translation  by Cardoso, J.).  Coimbra University Press, Coimbra, Portugal, ISBN: 978-989-26-000-0, pp. 316, 2009. &nbsp; Cardoso,  J. and Aalst,  W. v. d. Handbook of Research on Business Process Modeling.  Information Science Reference, Hershey, PA, ISBN: 9781605662886 (hardcover) 9781605662893 (ebook), 2009. &nbsp; Cardoso,  J. Programa&ccedil;&atilde;o de Sistemas Distribu&iacute;dos em Java.  FCA, Lisboa, Portugal, ISBN: 978-972-722-601-6, pp. 384, 2008. &nbsp; Cardoso,  J. and Lytras,  M. Semantic Web Engineering in the Knowledge Society.  Information Science Reference, IGI Global, Hershey, New York, pp. 424, 2008. &nbsp; Cardoso,  J. Semantic Web Services: Theory, Tools and Applications.  Information Science Reference, New York, NY, USA, ISBN: 978-1-59904-045-5, 2007. &nbsp; Cardoso,  J.; Hepp,  M. and Lytras,  M. The Semantic Web: Real-World Applications from Industry.  Springer, Heidelberg, Germany, pp. 308, 2007. &nbsp; Cardoso,  J. and Sheth,  A. Semantic Web Services, Processes and Applications.  Springer, ISBN: 0-38730239-5, 2006. &nbsp; Conference ProceedingsFilipe,  J.; Cordeiro,  J. and Cardoso,  J., ed. Enterprise Information Systems.  Springer, Berlin, Heidelberg, LNBIP, Vol. , ISBN: 978-3-540-88709-6, pp. 379, 2009. &nbsp; Cardoso,  J., ed. Proceedings of the ICEIS 2008 Doctoral ConsortiumJCS. , Barcelona, Spain, ISBN: 978-989-8111-41-8, 2008. Cardoso,  J., ed. Proceedings of the ICEIS 2007 Doctoral Consortium. , Funchal, Madeira, Portugal, ISBN: 978-989-8111-04-3, 2007. Cardoso,  J.; Cordeiro,  J. and Filipe,  J., ed. Proceedings of the Ninth International Conference on Enterprise Information  Systems (ICEIS 2007). , Funchal, Madeira, Portugal, ISBN: 978-972-8865-88-7, 2007. Cardoso,  J.; Cordeiro,  J. and Filipe,  J., ed. Proceedings of the Ninth International Conference on Enterprise Information  Systems (ICEIS 2007). , Funchal, Madeira, Portugal, ISBN: 978-972-8865-89-4, 2007. Cardoso,  J.; Cordeiro,  J. and Filipe,  J., ed. Proceedings of the Ninth International Conference on Enterprise Information  Systems (ICEIS 2007). , Funchal, Madeira, Portugal, ISBN: 978-972-8865-90-0, 2007. Cardoso,  J.; Cordeiro,  J. and Filipe,  J., ed. Proceedings of the Ninth International Conference on Enterprise Information  Systems (ICEIS 2007). , Funchal, Madeira, Portugal, ISBN: 978-972-8865-91-7, 2007. Cardoso,  J.; Cordeiro,  J. and Filipe,  J., ed. Proceedings of the Ninth International Conference on Enterprise Information  Systems (ICEIS 2007). , Funchal, Madeira, Portugal, ISBN: 978-972-8865-92-4, 2007. Cardoso,  J. and Sheth,  A., ed. Semantic Web Process: powering next generation of processes with  Semantics and Web services.  Lecture Notes in Computer Science, Springer-Verlag, Heidelberg, pp. 147, 2005. &nbsp; Cardoso,  J. and Sheth,  A., ed. Proceedings of the 2nd International Workshop on Semantic and Dynamic  Web Processes (SDWP 2005). In conjunction with the 2005 IEEE International  Conference on Web Services (ICWS 2005). , Florida, USA, 2005. &nbsp; Technical ReportsCardoso, J. On the suitability of USDL for service description -- A case study  of a telecom operator.  Technical Report UC-DEI-GSI-2012-02, Department of Engineering Informatics, University of Coimbra, Coimbra, Portugal, 2012. PhD ThesesCardoso,  J. Quality of Service and Semantic Composition of Workflows.  Ph.D. Thesis, University of Georgia, Department of Computer Science, Athens, GA, USA, 2002.   Master's ThesesCardoso,  J. Sistema Computorizado para a Automatizacao de Processos Organizacionais.  Master's Thesis, University of Coimbra, Department of Informatics Engineering, Coimbra, Portugal, 1998. Keynotes, invited talks, summer schoolsCardoso,  J. Service Engineering for The Internet of Service.  Porto Salvo, Portugal, 2009. Cardoso,  J. Process Management and Integration with SAP.  Ciudad Real, Spain, 2008. Cardoso,  J. Semantics in Applications.  Dresden, Germany, 2008. Cardoso,  J. Semantic Web Services and Semantic-based Service Engineering.  San Servolo Island, Venice, Italy, 2008. Cardoso,  J. ISE - Model-Driven Service Engineering.  Stavanger, Norway, 2008. Cardoso,  J. Using Semantics to Enhance B2B Integration.  Corfu, Greece, 2007.   Cardoso,  J. Where do the Semantic Web and SOA meet?.  Vienna, Austria, 2007.   Cardoso,  J. Quality Metrics for Business Processes.  Zaragoza, Spain, 2007. &nbsp; Cardoso,  J. Semantic Web Challenges.  University of Bergen, Norway, 2007. Cardoso,  J. BPQM: Theory and applications.  University of Ciudad Real, Spain, 2007. Cardoso,  J. Tools and applications to make organizational knowledge explicit  for the Semantic Web.  University of Dresden, Germany, 2007. Cardoso,  J. Increasing your ROI by making your organizational knowledge explicit  for the Semantic Web.  University of Koblentz, Germany, 2007. Cardoso,  J. Service Engineering.  Barcelona, Spain, 2007. Cardoso,  J. Business Process Quality Metrics.  Technical University of Eindhoven, The Netherlands, 2006. Jos&eacute; Carlos del Arco,  J. A. F. &. C.  J. C. Presentaci&oacute;n. Los Servicios Web desde un punto de vista empresarial  y acad&eacute;mico. , 2006, n� 183.   Cardoso,  J. trends for 2005. , 2005, AIS SIGSEMIS Bulletin, March 2005. Cardoso,  J. Semantic Web Services: Progress in 2004 and trends for 2005. , 2005, AIS SIGSEMIS Bulletin, March 2005.   Cardoso,  J. On the move to Semantic Web services.  Budapest, Hungary, 2005. Cardoso,  J.; Bussler,  C. and Sheth,  A. Lifecycle of Semantic Web Processes.  Porto, Portugal, 2005. Cardoso,  J. Semantic Web Processes and Ontologies for the Travel Industry. , 2004, AIS SIGSEMIS Bulletin, October 2004.   Cardoso,  J.; Curbera,  F. and Sheth,  A. Service Oriented Archiectures and Semantic Web Processes.  New York, USA, 2004.   Cardoso,  J. Semantic Web Services.  Rome, Italy, 2003. Cardoso,  J. and Sheth,  A. Semantic Web Processes.  Erfurt, Germany, 2003.   Cardoso,  J. Workflow Management Systems: Introduction and Research Issues.  Athens, USA, 2002. Cardoso,  J. Stochastic Workflow Reduction Algorithm.  University of Georgia, USA, 2002. &nbsp; Cardoso,  J.; Bussler,  C. and Sheth,  A. Semantic Web Services and Processes: Semantic Composition and Quality  of Service.  Irvine, CA, USA, 2002.   Cardoso,  J. and Bussler,  C. MARATHON - Workflow Management System.  Seattle, WA, USA, The Boeing Company, 1999. &nbsp; ",
            "link": "http://0.0.0.0:4000/publications/",
            "date": null,
            "excerpt": null
        }
    

    
        ,{
            "title": "Courses Taught",
            "content": "+ UC Databases and Information Analysis  + KIT Service-Oriented Computing + UC Information Systems + UC Organizational behavior+ UC Information Systems Management+ UC Human-Computer Interaction+ UMA Semantic Web + UMA Distributed Systems+ UMA Computer Architecture+ UMA Enterprise Integration+ UMA Decision Support Systems+ UMA Information Systems Architecture+ UMA Technological Architecture of Information Systems+ UMA Information and Communication Technologies Applied to Tourism+ UMA Implementation and Control of Quality Initiative and Project Management+ UMA Requirements Specification and Modeling+ UG Introduction to Computing and Programming + UPL Microprocessors + UPL Computer and Programming##### LegendUniversity of Coimbra, Portugal UC; Karlsruhe Institute of Technology (KIT), Germany KIT; University of Madeira, Portugal UMA; University of Georgia, USA UG; Polytechnic Institute of Leiria, Portugal UPL.",
            "link": "http://0.0.0.0:4000/courses/",
            "date": null,
            "excerpt": null
        }
    

    
        ,{
            "title": "Research",
            "content": "Research topics for PhD/MSc-----------------You would like to do research? Maybe your MSc or PhD? You love to discover new things? To propose new innovative ideas? You like the areas of Service Science, Business Process Management, Information Systems, and Semantic Web?                  Then you should send me an e-mail (jcardoso hhatte dei.uc.pt) and/or we should have a chat (office D2.20). I always have a couple of interesting topics to be explored.Research Streams---------------Our recent research places emphasis on three fields: service description languages (with the USDL family), service system modeling (with the LSS USDL language), and service networks (using principals from social networks).####Service Descriptions Linked USDL (Unified Service Description Language) was developed for describing business, software, or real-world services using computer-readable and computer-understandable specifications to make them tradable on the web/Internet. Linked USDL takes the form of a reference schema which is an approach used in many fields to facilitate the exchange of data and integration of information systems. For example, online social networks rely on FOAF to describe people and relationships; computer systems use WSDL to describe distributed software-based services; GoodRelations is used to mainly describe products; and business-to-business systems use ebXML to describe transactions, orders, and invoices. Adding to these existing standards, Linked USDL describes services in a comprehensive way by providing a business or commercial description around (real-world) services.Therefore, Linked USDL is seen has one of the foundational technologies for setting up emerging infrastructures for the Future Internet, web service ecosystems, and the Internet of Services. ####Service SystemsThis field explores the development of lightweight semantic models to capture the essence of service systems. The field includes key topics such as modeling frameworks, service descriptions and linked data, creating service instances, tool support, and applications in enterprises. We have proposed a service system model called Linked Service System model for the Unified Service Description Language (LSS-USDL). Real service systems can be modeled with LSS-USDL using semantic web languages, they can be accessed and queried programmatically, and they can be annotated with background knowledge.This approach provides descriptions that can be used for service management, optimization, and analytics.####Service Networks Societies are becoming increasingly service-oriented. Service revenues from companies, such as Rolls Royce, Caterpillar, and ThyssenKrupp, often reach more than 35\\% of total sales. In the field of information technology, the global spending on cloud services is expected to grow 40\\% over the next seven years. Despite these facts, services are still the least studied part of the economy.The observation that the power of service-based economies is no longer restricted to individual organizations, but spans across networks, is the main driver for conducting service network research. Networks play an important role in many application areas such as energy grid distribution and smart city planning. Service networks are a class of networks of emerging interest since worldwide economies are becoming increasingly connected. Nonetheless, while the economies of many countries are becoming service-oriented, very few studies on service networks exist. Understanding when, why, where, and how service networks function best is fundamental for the future because their analysis can provide an ``x-ray'' of service-based economies.Current Projects-----------------+ Linked USDL. RDF, semantic web, linked data+ LSS USDL.+ Service Networks.Writing a Paper-----------------The Ten Commandments for writing academic papersJulienne Hanson, Bartlett School of Architecture, London, November, 1988How to write a great research paperSimon Peyton Jones at Microsoft Research. Editor's View: an opportunity for editors of IS journals to relate their experiences and offer advice.The Editorial View of Ray J Paul. First in a series.The Top 10 Reasons Why Manuscripts Are Not Accepted for Publication (Medical domain)David J Pierson MD FAARCThe points your paper should address Is the research new?Is the research interesting?Is the research significant to the field of research?Does it clearly motivate and clearly formulate the research question?Does it identify the significant problems in the field of research?Does it outline the current knowledge of the problem domain, as well as the state of existing solutions?Does it present clearly any preliminary ideas, the proposed approach and the results achieved so far?Does it sketch the research methodology that is applied?Does it point out the contributions of the applicant to the problem solution?Does it state in what aspects the suggested solution is different, new or better as compared to existing approaches to the problem? Does it state how the expected results will be evaluated or compared to existing approaches to the problem?Does it state how and by whom the expected results can be applied?Writing a Thesis-----------------How to Read a PaperDavid R. Cheriton School of Computer Science, University of WaterlooWaterloo, ON, CanadaWRITING RESEARCH THESES OR DISSERTATIONS (guidelines and tips)School of Chemical Engineering and Advanced Materials, University of Newcastle upon TyneWriting a Thesis Proposal: Independent Learning Resources Learning Centre, University of SydneyHow to write referencesAston University, Aston Triangle, Birmingham, B4 7ET.Past Projects ------------------------------###Semantic Domain SystemEnterprises have the need to communicate. In business to business applications, usually XML is used to automatically exchange information. But sometimes more semantics is needed. Enterprises  also need to share concepts, terms, definitions and relationships (between concepts) relevant to their business activities.Why are developing the Semantic Domain System which is a systems that follows similar concepts from the DNS. The Domain Name System or DNS, is a service where relationships between IP addresses and physical domains are stored. When you request your browser, email client, ftp client or any other application to search for a specific domain, it automatically calls the DNS Server and finds the IP for the machine that offers the required service. It enables the use of names instead of IP addresses. Each company is responsible for maintaining their own IP addresses.In SDS, like in DNS, each company is responsible for managing their own concepts and is able to browse other companies'concept definitions. The system will allow a clear representation of concepts and relationships between concepts.\t  ###Semantic B2B IntegrationB2B integration, also known as external IS integration and e-business integration, has promised to automate and integrate business processes and interactions between companies by considerably renovating the way business was conducted with partners, suppliers, and customers. B2B integration is fundamentally about data and information exchange among businesses and their information systems. The ability to interact and exchange information both internally and with external organizations (partners, suppliers, customers) is a fundamental issue in the enterprise sector.One simple solution that organizations have adopted to reach a higher level of integration relied on the use of XML as thelanguage to represent data. XML has become a de facto standard of B2B because of its simplicity, extensibility and ease ofprocessing. Today its estimated that most organizations use XML to store and transfer data. This is the reason why we created B2BISS (Business-to-Business Integration using Syntactic-to-Semantic Mapping)\t  ### JXML2OWL Today's enterprises face critical needs in integrating disparate information spread over several data sources inside and even outside the organization. Semantic web technologies, such as ontologies, play an important role in the semantic integration of data. The purpose of JXMLOWL is to present a framework to assist the semantic data integration process. The framework supports mappings and instances transformation from syntactic data sources in XML format to a common  global model defined by an ontology using semantic web related technologies such as OWL- ### Business Process Quality MetricsOur intentions are twofold. On the one hand, we think it is fundamental to survey findings from neighboring disciplines on how Business Process Quality Metrics can be developed. In particular, we believe that we can gather additional insights from software engineering, cognitive science, and graph theory and relate them to business process modeling. A further empirical investigation might ultimately lead to establishing a complexity theory of business process models. On the other hand, we plan to demonstrate that these metrics serves their purpose, we plan to carry out several empirical validations by means of controlled experiments.### Other projects+ Process Control-Flow Analysis (http://apus.uma.pt/~jcardoso/ComplexityAnalysis/index.php)+ Semantic Dynamic Packaging (POSI/EIA/56164/2004).+ DME&nbsp;Web Site Development, Jos&eacute; Nelson Alves e Duarte Abreu.+ Poseidon: A tool for semi-automatic process design,Jos&eacute; Miguel Rodrigues de Freitas and Luis Roberto Fernandes Faria.+ Web Services over Peer-to-Peer infrastructure, Martinho da Silva Correia.+ Quality of Service Management for METEOR Workflow Management System, University of Georgia, GA, USA.+ Semantic e-Workflow Composition for METEOR Workflow Management System, University of Georgia, GA, USA.+ MARATHON - Workflow Management System, Jorge Cardoso and Christoph Bussler, Boeing Company, July 1999, WA, USA.+ SketchPad, CCG/ZGDV - Centro de Computa&ccedil;&atilde;o Gr&aacute;fica and IGD/Darmstadt, Germany+ DiagLactato 2.0 (in Portuguese) - An Expert System for Healthcare, Septembre 1994.+ CUCo - Comunicar Utilizando o Computador, Projecto Minerva, Universidade de Coimbra, 1994.+ Puzzle Quiz, Projecto Minerva, Universidade de Coimbra, 1992.+T ask Game, Projecto Minerva, Universidade de Coimbra, 1991.Past Students-----------------+ Coimbra+ KIT+ SAP+ Madeira\t",
            "link": "http://0.0.0.0:4000/research/",
            "date": null,
            "excerpt": null
        }
    

    
        ,{
            "title": "Books Published",
            "content": "{% for post in site.categories.books %}\t{% include post-grid-books.html %}{% endfor %}",
            "link": "http://0.0.0.0:4000/books/",
            "date": null,
            "excerpt": null
        }
    

    

    

]
